dan99git/esp-thread-br/examples/bos_c6_tmfs_test/sdkconfig.defaults
# Building OS bare ESP32-C6 ThreadTorrent-lite test defaults.
CONFIG_IDF_TARGET="esp32c6"

# Console over native USB Serial/JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n

# 4MB XIAO/ESP32-C6 flash, single factory app for bench flashing.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# OpenThread FTD on the native 802.15.4 radio.
CONFIG_IEEE802154_ENABLED=y
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_BORDER_ROUTER=n
CONFIG_OPENTHREAD_FTD=y
CONFIG_OPENTHREAD_RADIO_NATIVE=y
CONFIG_OPENTHREAD_CLI=n
CONFIG_OPENTHREAD_COMMISSIONER=n
CONFIG_OPENTHREAD_JOINER=n
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_NUM_MESSAGE_BUFFERS=64

# Keep Wi-Fi out of the bare Thread test image.
CONFIG_ESP_WIFI_ENABLED=n

# ThreadTorrent-lite auth uses HMAC-SHA256.
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_FREERTOS_HZ=1000
CONFIG_NVS_ENCRYPTION=n
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
